dial = {
    'A': 2,
    'B': 2,
    'C': 2,
    'D': 3,
    'E': 3,
    'F': 3,
    'G': 4,
    'H': 4,
    'I': 4,
    'J': 5,
    'K': 5,
    'L': 5,
    'M': 6,
    'N': 6,
    'O': 6,
    'P': 7,
    'Q': 7,
    'R': 7,
    'S': 7,
    'T': 8,
    'U': 8,
    'V': 8,
    'W': 9,
    'X': 9,
    'Y': 9,
    'Z': 9
}

s = input().strip()
total = 0
for c in s:
    total += int(dial[c]) + 1
print(total)
#ksoosung77   1달 전    1좋아요
#int(word-'A')/3+2 이렇게 어떤가요

#중간에 4개 있을때는 그 뒤로 조건문으로 +1씩 더 하면 될 꺼 같네요

#pentagon03   1달 전    1좋아요
#해당 문제의 숏코딩, 언어별 숏코딩 코드들을 확인해보세요. 배울 수 있는 로직이 많습니다.

#dmsrud51821   1달 전    1좋아요
#a_list = ['', '','', 'ABC', 'DEF', 'GHI', 'JKL','MNO', 'PQRS', 'TUV', 'WXYZ']

#이런식으로 리스트를 만든다음 각 단어가 리스트의 어느부분에 속하는지 찾아내고 다 더하는 로직을 작성하면 될 것같네요

#20210805   1달 전    1좋아요
#코드가 길긴 하지만 나쁘지는 않아 보입니다.

#알파벳-숫자 매칭정도는 하드코딩해도 괜찮을 것 같아요.